public/man/man1/dnssec-revoke.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - dnssec-revoke.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - dnssec-revoke.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>dnssec-revoke - set the REVOKED bit on a DNSSEC key</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>dnssec-revoke</strong> [*-hr*] [*-v* level] [*-V*] [*-K* directory] [*-E*
engine] [*-f*] [*-R*] {keyfile}</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>dnssec-revoke</strong> reads a DNSSEC key file, sets the REVOKED bit on the key
as defined in <em>RFC 5011</em>, and creates a new pair of key files containing
the now-revoked key.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<blockquote>
<dl>
<dt>
<strong>-h</strong>
</dt>
<dd>This option emits a usage message and exits.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-K directory</strong>
</dt>
<dd>This option sets the directory in which the key
files are to reside.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-r</strong>
</dt>
<dd>This option indicates to remove the original keyset files
after writing the new keyset files.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-v level</strong>
</dt>
<dd>This option sets the debugging level.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-V</strong>
</dt>
<dd>This option prints version information.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-E engine</strong>
</dt>
<dd>This option specifies the cryptographic hardware to
use, when applicable.

When BIND 9 is built with OpenSSL, this needs to be set to the OpenSSL
engine identifier that drives the cryptographic accelerator or
hardware service module (usually <strong>pkcs11</strong>).</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-f</strong>
</dt>
<dd>This option indicates a forced overwrite and causes
<strong>dnssec-revoke</strong> to write the new key pair, even if a file already
exists matching the algorithm and key ID of the revoked key.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-R</strong>
</dt>
<dd>This option prints the key tag of the key with the REVOKE bit
set, but does not revoke the key.</dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
SEE ALSO
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><em>dnssec-keygen(8)</em>, BIND 9 Administrator Reference Manual, <em>RFC 5011</em>.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
AUTHOR
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Internet Systems Consortium</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
COPYRIGHT
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>2024, Internet Systems Consortium</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
